source/chapter-8/fixtures/subscription.json

{
    "id": "sub_6XTRPLoPvFkZAd",
    "plan": {
        "id": "silver",
        "interval": "month",
        "name": "Silver",
        "created": 1415672471,
        "amount": 1500,
        "currency": "usd",
        "object": "plan",
        "livemode": false,
        "interval_count": 1,
        "trial_period_days": null,
        "metadata": {},
        "statement_descriptor": null
    },
    "object": "subscription",
    "start": 1435908724,
    "status": "active",
    "customer": "cus_6XTROqQpg2yLCv",
    "cancel_at_period_end": false,
    "current_period_start": 1435908120,
    "current_period_end": 1438586520,
    "ended_at": null,
    "trial_start": null,
    "trial_end": null,
    "canceled_at": null,
    "quantity": 1,
    "application_fee_percent": null,
    "discount": null,
    "tax_percent": null,
    "metadata": {}
}